In [1]:
import pandas as pd
import numpy as np

In [8]:
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(df1)
print(type(df1))

   0
0  1
1  2
2  3
3  4
4  5
<class 'pandas.core.frame.DataFrame'>

In [10]:
df1['1col'] = list
print(df1)

   0  1col
0  1     1
1  2     2
2  3     3
3  4     4
4  5     5

In [15]:
print(df1.columns)

Index([0, '1col'], dtype='object')

In [16]:
df2 = df1.rename(columns={0 : "0col"})
print(df2)

   0col  1col
0     1     1
1     2     2
2     3     3
3     4     4
4     5     5

In [18]:
score = [
    ['jeongyackyoung',70,80,100],
    ['leesunsin',60,50,90],
    ['leeyoulgock',50,100,60]
]
print(type(score))
print(score)

<class 'list'>
[['jeongyackyoung', 70, 80, 100], ['leesunsin', 60, 50, 90], ['leeyoulgock', 50, 100, 60]]

In [20]:
df3 = pd.DataFrame(score)
print(df3)
print(type(df3))

                0   1    2    3
0  jeongyackyoung  70   80  100
1       leesunsin  60   50   90
2     leeyoulgock  50  100   60
<class 'pandas.core.frame.DataFrame'>

In [23]:
df3.columns = ["name", "korean", "english", "math"]
print(df3)
print(df3.shape)
print(df3.index)

             name  korean  english  math
0  jeongyackyoung      70       80   100
1       leesunsin      60       50    90
2     leeyoulgock      50      100    60
(3, 4)
RangeIndex(start=0, stop=3, step=1)

In [25]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1   korean   3 non-null      int64
 2   english  3 non-null      int64
 3   math     3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [27]:
df3.describe()

       korean     english        math
count     3.0    3.000000    3.000000
mean     60.0   76.666667   83.333333
std      10.0   25.166115   20.816660
min      50.0   50.000000   60.000000
25%      55.0   65.000000   75.000000
50%      60.0   80.000000   90.000000
75%      65.0   90.000000   95.000000
max      70.0  100.000000  100.000000

In [ ]:
dic1 = {
  'col1' : ["1","2","3",'4'],
  'col2' : [5,6,7,8]
}

n = pd.DataFrame(dic1)
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [42]:
n.info()
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [44]:
n_df = n.astype({'col1': int, 'col2':float})
print(n_df.dtypes)
n_df.describe()

col1      int64
col2    float64
dtype: object

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [51]:
display(n_df[['col1','col2']])

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

In [54]:
for index,row in n_df.iterrows():
    print(row['col2'])

5.0
6.0
7.0
8.0

In [57]:
n_df
n_df['sum'] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [58]:
n_df[n_df['sum'] >= 8]

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [60]:
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [61]:
n1_df = n_df[n_df["sum"]>=8]
print(n1_df)

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [73]:
n1_df.reset_index(drop=True)
# n1_df.reset_index()

n1_sum = n1_df['sum']
print(n1_sum)

1     8.0
2    10.0
3    12.0
Name: sum, dtype: float64

In [78]:
print(n1_sum)
print(type(n1_sum))
print(n1_sum.shape)

1     8.0
2    10.0
3    12.0
Name: sum, dtype: float64
<class 'pandas.core.series.Series'>
(3,)

In [4]:
import pandas as pd

titanic_df = pd.read_csv("data/titanic.csv")
titanic_df

print(titanic_df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [84]:
len(titanic_df)
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [86]:
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [87]:
titanic_df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [93]:
titanic_df.sort_values(by="age",ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [5]:
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [6]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})

In [16]:
# df.info()
# df.describe()
df1 = df['name']
print(df1)
print(df1.shape)
print(type(df1))
print(type(df))
print(df.shape)

0    Jessica
1       Liam
2     Sophia
3       Ryan
4       Alex
Name: name, dtype: object
(5,)
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
(5, 4)

In [20]:
df2= df1.to_frame()
df2

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [27]:
df5 = df[['name','test']]
print(df5)
print(df5.shape)

      name  test
0  Jessica    45
1     Liam    30
2   Sophia    40
3     Ryan    37
4     Alex    48
(5, 2)

In [29]:
df8 = df[['name']]
print(df8)
print(df8.shape)

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
(5, 1)

In [41]:
df8.columns = ['Name']
print(df8)

      Name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [47]:
df8.rename(columns={'Name': 'name'}, inplace=True)
print(df8)

     names
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [52]:
df = df.rename(columns={'test': 'exem'})
df

      name  exem  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [54]:
df['sum'] = df['exem']  + df['assign1'] + df['assign2']
df

      name  exem  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [57]:
df1 = df[['name','sum']]
print(df)
print(df1)

      name  exem  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97
      name  sum
0  Jessica   84
1     Liam   61
2   Sophia   80
3     Ryan   70
4     Alex   97

In [61]:
df[df['sum'] >= 80][['name', 'sum']]

      name  sum
0  Jessica   84
2   Sophia   80
4     Alex   97

In [63]:
df2 = df[df['sum'] >= 80][['name', 'sum']]
df2

      name  sum
0  Jessica   84
2   Sophia   80
4     Alex   97

In [106]:
df3 = df2.reset_index(drop=True)
df3

      name  sum
0  Jessica   84
1   Sophia   80
2     Alex   97

In [72]:
df4 = df3.sort_values(by='sum', ascending=False).reset_index(drop=True)
df4

      name  sum
0     Alex   97
1  Jessica   84
2   Sophia   80

In [74]:
df

      name  exem  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [77]:
df['grade'] = np.where(
    df['sum']>=90,'A',
    np.where(
        df['sum']>=80,'B',
        'C'
    )
    )
df

      name  exem  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [80]:
df['result'] = np.where(
    df['sum']>=80,'pass',
    'fail'
)
df

      name  exem  assign1  assign2  sum grade result
0  Jessica    45       20       19   84     B   pass
1     Liam    30       17       14   61     C   fail
2   Sophia    40       22       18   80     B   pass
3     Ryan    37       18       15   70     C   fail
4     Alex    48       24       25   97     A   pass

In [105]:
df_count = df['result'].value_counts()
print(df_count)
print(df_count.shape)
print(type(df_count))
df_c = df_count.to_frame()
df_c
print(df_c)
print(df_c.shape)

KeyError: 'result'

In [92]:
df_c.reset_index(drop=True)

   count
0      3
1      2

In [94]:
df['grade'].value_counts()

grade
B    2
C    2
A    1
Name: count, dtype: int64

In [104]:
# inplace : columnëª… ë³€ê²½, ì‚­ì œ, row ì‚­ì œ

df.drop(columns='result', inplace=True)

KeyError: "['result'] not found in axis"

In [109]:
df.drop(index=[1,2])
df

      name  exem  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [113]:
df.drop(df[df['sum']<80].index)
df

      name  exem  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [117]:
df.drop(df[df['sum']<80].index, inplace=True)
df

      name  exem  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
2   Sophia    40       22       18   80     B
4     Alex    48       24       25   97     A

In [132]:
print(df.loc[0,'exem'])
print(df.loc[0, ['exem']].shape)

45
(1,)

In [138]:
df.iloc[0:2, 1:3]
df.iloc[:,-1]

0    B
2    B
4    A
Name: grade, dtype: object

In [140]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [145]:
df.describe()
df['gender'].value_counts()

gender
F    2
M    1
Name: count, dtype: int64

In [148]:
pd.isna(df).sum()

name      0
gender    2
score     1
dtype: int64

In [152]:
clean_df = df.dropna()
print(clean_df)
print(df)

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [155]:
c_df = df.dropna(subset=['score'])
c_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [161]:
# df1 = df.fillna(0)

df1 = df.fillna({'gender': 'etc', 'score' : df['score'].mean()})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

In [163]:
df1['gender'].value_counts()

gender
F      2
etc    2
M      1
Name: count, dtype: int64

In [164]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0